garyPenhook/PIC-Assembler/device_includes/pic16f13256.inc
// Register: PWMIN0PPS
#define PWMIN0PPS PWMIN0PPS
PWMIN0PPS                                equ 01E24h
// bitfield definitions
PWMIN0PPS_PWMIN0PPS_POSN                 equ 0000h
PWMIN0PPS_PWMIN0PPS_POSITION             equ 0000h
PWMIN0PPS_PWMIN0PPS_SIZE                 equ 0007h
PWMIN0PPS_PWMIN0PPS_LENGTH               equ 0007h
PWMIN0PPS_PWMIN0PPS_MASK                 equ 007Fh

// Register: PWMIN1PPS
#define PWMIN1PPS PWMIN1PPS
PWMIN1PPS                                equ 01E25h
// bitfield definitions
PWMIN1PPS_PWMIN1PPS_POSN                 equ 0000h
PWMIN1PPS_PWMIN1PPS_POSITION             equ 0000h
PWMIN1PPS_PWMIN1PPS_SIZE                 equ 0007h
PWMIN1PPS_PWMIN1PPS_LENGTH               equ 0007h
PWMIN1PPS_PWMIN1PPS_MASK                 equ 007Fh

// Register: PWM1ERSPPS
#define PWM1ERSPPS PWM1ERSPPS
PWM1ERSPPS                               equ 01E26h
// bitfield definitions
PWM1ERSPPS_PWM1ERSPPS_POSN               equ 0000h
PWM1ERSPPS_PWM1ERSPPS_POSITION           equ 0000h
PWM1ERSPPS_PWM1ERSPPS_SIZE               equ 0007h
PWM1ERSPPS_PWM1ERSPPS_LENGTH             equ 0007h
PWM1ERSPPS_PWM1ERSPPS_MASK               equ 007Fh

// Register: PWM2ERSPPS
#define PWM2ERSPPS PWM2ERSPPS
PWM2ERSPPS                               equ 01E27h
// bitfield definitions
PWM2ERSPPS_PWM2ERSPPS_POSN               equ 0000h
PWM2ERSPPS_PWM2ERSPPS_POSITION           equ 0000h
PWM2ERSPPS_PWM2ERSPPS_SIZE               equ 0007h
PWM2ERSPPS_PWM2ERSPPS_LENGTH             equ 0007h
PWM2ERSPPS_PWM2ERSPPS_MASK               equ 007Fh

// Register: CLCIN0PPS
#define CLCIN0PPS CLCIN0PPS
CLCIN0PPS                                equ 01E3Dh
// bitfield definitions
CLCIN0PPS_CLCIN0PPS_POSN                 equ 0000h
CLCIN0PPS_CLCIN0PPS_POSITION             equ 0000h
CLCIN0PPS_CLCIN0PPS_SIZE                 equ 0007h
CLCIN0PPS_CLCIN0PPS_LENGTH               equ 0007h
CLCIN0PPS_CLCIN0PPS_MASK                 equ 007Fh

// Register: CLCIN1PPS
#define CLCIN1PPS CLCIN1PPS
CLCIN1PPS                                equ 01E3Eh
// bitfield definitions
CLCIN1PPS_CLCIN1PPS_POSN                 equ 0000h
CLCIN1PPS_CLCIN1PPS_POSITION             equ 0000h
CLCIN1PPS_CLCIN1PPS_SIZE                 equ 0007h
CLCIN1PPS_CLCIN1PPS_LENGTH               equ 0007h
CLCIN1PPS_CLCIN1PPS_MASK                 equ 007Fh

// Register: CLCIN2PPS
#define CLCIN2PPS CLCIN2PPS
CLCIN2PPS                                equ 01E3Fh
// bitfield definitions
CLCIN2PPS_CLCIN2PPS_POSN                 equ 0000h
CLCIN2PPS_CLCIN2PPS_POSITION             equ 0000h
CLCIN2PPS_CLCIN2PPS_SIZE                 equ 0007h
CLCIN2PPS_CLCIN2PPS_LENGTH               equ 0007h
CLCIN2PPS_CLCIN2PPS_MASK                 equ 007Fh

// Register: CLCIN3PPS
#define CLCIN3PPS CLCIN3PPS
CLCIN3PPS                                equ 01E40h
// bitfield definitions
CLCIN3PPS_CLCIN3PPS_POSN                 equ 0000h
CLCIN3PPS_CLCIN3PPS_POSITION             equ 0000h
CLCIN3PPS_CLCIN3PPS_SIZE                 equ 0007h
CLCIN3PPS_CLCIN3PPS_LENGTH               equ 0007h
CLCIN3PPS_CLCIN3PPS_MASK                 equ 007Fh

// Register: CK1PPS
#define CK1PPS CK1PPS
CK1PPS                                   equ 01E41h
// bitfield definitions
CK1PPS_CK1PPS_POSN                       equ 0000h
CK1PPS_CK1PPS_POSITION                   equ 0000h
CK1PPS_CK1PPS_SIZE                       equ 0007h
CK1PPS_CK1PPS_LENGTH                     equ 0007h
CK1PPS_CK1PPS_MASK                       equ 007Fh

// Register: RX1PPS
#define RX1PPS RX1PPS
RX1PPS                                   equ 01E42h
// bitfield definitions
RX1PPS_RX1PPS_POSN                       equ 0000h
RX1PPS_RX1PPS_POSITION                   equ 0000h
RX1PPS_RX1PPS_SIZE                       equ 0007h
RX1PPS_RX1PPS_LENGTH                     equ 0007h
RX1PPS_RX1PPS_MASK                       equ 007Fh

// Register: CK2PPS
#define CK2PPS CK2PPS
CK2PPS                                   equ 01E43h
// bitfield definitions
CK2PPS_CK2PPS_POSN                       equ 0000h
CK2PPS_CK2PPS_POSITION                   equ 0000h
CK2PPS_CK2PPS_SIZE                       equ 0007h
CK2PPS_CK2PPS_LENGTH                     equ 0007h
CK2PPS_CK2PPS_MASK                       equ 007Fh

// Register: RX2PPS
#define RX2PPS RX2PPS
RX2PPS                                   equ 01E44h
// bitfield definitions
RX2PPS_RX2PPS_POSN                       equ 0000h
RX2PPS_RX2PPS_POSITION                   equ 0000h
RX2PPS_RX2PPS_SIZE                       equ 0007h
RX2PPS_RX2PPS_LENGTH                     equ 0007h
RX2PPS_RX2PPS_MASK                       equ 007Fh

// Register: SSP1CLKPPS
#define SSP1CLKPPS SSP1CLKPPS
SSP1CLKPPS                               equ 01E47h
// bitfield definitions
SSP1CLKPPS_SSP1CLKPPS_POSN               equ 0000h
SSP1CLKPPS_SSP1CLKPPS_POSITION           equ 0000h
SSP1CLKPPS_SSP1CLKPPS_SIZE               equ 0007h
SSP1CLKPPS_SSP1CLKPPS_LENGTH             equ 0007h
SSP1CLKPPS_SSP1CLKPPS_MASK               equ 007Fh

// Register: SSP1DATPPS
#define SSP1DATPPS SSP1DATPPS
SSP1DATPPS                               equ 01E48h
// bitfield definitions
SSP1DATPPS_SSP1DATPPS_POSN               equ 0000h
SSP1DATPPS_SSP1DATPPS_POSITION           equ 0000h
SSP1DATPPS_SSP1DATPPS_SIZE               equ 0007h
SSP1DATPPS_SSP1DATPPS_LENGTH             equ 0007h
SSP1DATPPS_SSP1DATPPS_MASK               equ 007Fh

// Register: SSP1SSPPS
#define SSP1SSPPS SSP1SSPPS
SSP1SSPPS                                equ 01E49h
// bitfield definitions
SSP1SSPPS_SSP1SSPPS_POSN                 equ 0000h
SSP1SSPPS_SSP1SSPPS_POSITION             equ 0000h
SSP1SSPPS_SSP1SSPPS_SIZE                 equ 0007h
SSP1SSPPS_SSP1SSPPS_LENGTH               equ 0007h
SSP1SSPPS_SSP1SSPPS_MASK                 equ 007Fh

// Register: SSP2CLKPPS
#define SSP2CLKPPS SSP2CLKPPS
SSP2CLKPPS                               equ 01E4Ah
// bitfield definitions
SSP2CLKPPS_SSP2CLKPPS_POSN               equ 0000h
SSP2CLKPPS_SSP2CLKPPS_POSITION           equ 0000h
SSP2CLKPPS_SSP2CLKPPS_SIZE               equ 0007h
SSP2CLKPPS_SSP2CLKPPS_LENGTH             equ 0007h
SSP2CLKPPS_SSP2CLKPPS_MASK               equ 007Fh

// Register: SSP2DATPPS
#define SSP2DATPPS SSP2DATPPS
SSP2DATPPS                               equ 01E4Bh
// bitfield definitions
SSP2DATPPS_SSP2DATPPS_POSN               equ 0000h
SSP2DATPPS_SSP2DATPPS_POSITION           equ 0000h
SSP2DATPPS_SSP2DATPPS_SIZE               equ 0007h
SSP2DATPPS_SSP2DATPPS_LENGTH             equ 0007h
SSP2DATPPS_SSP2DATPPS_MASK               equ 007Fh

// Register: SSP2SSPPS
#define SSP2SSPPS SSP2SSPPS
SSP2SSPPS                                equ 01E4Ch
// bitfield definitions
SSP2SSPPS_SSP2SSPPS_POSN                 equ 0000h
SSP2SSPPS_SSP2SSPPS_POSITION             equ 0000h
SSP2SSPPS_SSP2SSPPS_SIZE                 equ 0007h
SSP2SSPPS_SSP2SSPPS_LENGTH               equ 0007h
SSP2SSPPS_SSP2SSPPS_MASK                 equ 007Fh

// Register: ADACTPPS
#define ADACTPPS ADACTPPS
ADACTPPS                                 equ 01E50h
// bitfield definitions
ADACTPPS_ADACTPPS_POSN                   equ 0000h
ADACTPPS_ADACTPPS_POSITION               equ 0000h
ADACTPPS_ADACTPPS_SIZE                   equ 0007h
ADACTPPS_ADACTPPS_LENGTH                 equ 0007h
ADACTPPS_ADACTPPS_MASK                   equ 007Fh

// Register: CLBCLKPPS
#define CLBCLKPPS CLBCLKPPS
CLBCLKPPS                                equ 01E57h
// bitfield definitions
CLBCLKPPS_CLBCLKPPS_POSN                 equ 0000h
CLBCLKPPS_CLBCLKPPS_POSITION             equ 0000h
CLBCLKPPS_CLBCLKPPS_SIZE                 equ 0007h
CLBCLKPPS_CLBCLKPPS_LENGTH               equ 0007h
CLBCLKPPS_CLBCLKPPS_MASK                 equ 007Fh

